app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "Me"], ["body", "Myself and I "], ["post_id", 1], ["created_at", "2015-07-13 06:38:36.609548"], ["updated_at", "2015-07-13 06:38:36.609548"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)